[Killed] ConditionalExpression
src/acceptance-criteria-parser.ts:9:7
  * @returns Array of acceptance criteria strings
  */
 export function parseAcceptanceCriteria(issueBody: string): string[] {
-  if (!issueBody) {
+  if (true) {
     return [];
   }
killedBy: Issue #204: Auto-generate issues from acceptance criteria AC-1: Parse acceptance criteria from issue body extracts checkbox list items as acceptance criteria
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "First acceptance criteria",
-   "Second acceptance criteria",

[Killed] BooleanLiteral
src/acceptance-criteria-parser.ts:9:7
  * @returns Array of acceptance criteria strings
  */
 export function parseAcceptanceCriteria(issueBody: string): string[] {
-  if (!issueBody) {
+  if (issueBody) {
     return [];
   }
killedBy: Issue #204: Auto-generate issues from acceptance criteria AC-1: Parse acceptance criteria from issue body extracts checkbox list items as acceptance criteria
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "First acceptance criteria",
-   "Second acceptance criteria",

[Killed] Regex
src/acceptance-criteria-parser.ts:14:38
   }
 
   // Match unchecked checkbox items: - [ ] text
-  const UNCHECKED_CHECKBOX_PATTERN = /^- \[ \] (.+)$/gm;
+  const UNCHECKED_CHECKBOX_PATTERN = /- \[ \] (.+)$/gm;
   
   const matches = Array.from(issueBody.matchAll(UNCHECKED_CHECKBOX_PATTERN));
killedBy: Issue #204: Auto-generate issues from acceptance criteria AC-1: Parse acceptance criteria from issue body handles nested lists and indentation
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    "Top level criterion",
+   "Nested criterion (should be ignored)",

[Killed] MethodExpression
src/acceptance-criteria-parser.ts:17:31
   const UNCHECKED_CHECKBOX_PATTERN = /^- \[ \] (.+)$/gm;
   
   const matches = Array.from(issueBody.matchAll(UNCHECKED_CHECKBOX_PATTERN));
-  return matches.map(match => match[1].trim());
+  return matches.map(match => match[1]);
 }
killedBy: Issue #204: Auto-generate issues from acceptance criteria AC-1: Parse acceptance criteria from issue body extracts checkbox list items as acceptance criteria
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "First acceptance criteria",
-   "Second acceptance criteria",
