[Killed] BlockStatement
src/github-client.ts:29:78
     }
   }
 
-  async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
-    const tempFile = `/tmp/issue-${issueNumber}-body.md`;
-    
-    try {
-      writeFileSync(tempFile, newBody);
-      execSync(`gh issue edit ${issueNumber} --body-file ${tempFile}`);
-      unlinkSync(tempFile);
-    } catch (error: any) {
-      // Clean up temp file on error
-      try {
-        unlinkSync(tempFile);
-      } catch {}
-      throw new Error(`Failed to update issue #${issueNumber}: ${error.message}`);
-    }
-  }
+  async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {}
 }
 
killedBy: Issue #204: GitHub Client Tests GitHubCLIClient updateIssueBody should update issue body successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/issue-204-body.md", "Updated issue body"

Number of calls: 0

[Killed] StringLiteral
src/github-client.ts:30:22
   }
 
   async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
-    const tempFile = `/tmp/issue-${issueNumber}-body.md`;
+    const tempFile = ``;
     
     try {
killedBy: Issue #204: GitHub Client Tests GitHubCLIClient updateIssueBody should update issue body successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/issue-204-body.md", "Updated issue body"
Received: "", "Updated issue body"

Number of calls: 1

[Killed] BlockStatement
src/github-client.ts:32:9
   async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
     const tempFile = `/tmp/issue-${issueNumber}-body.md`;
     
-    try {
-      writeFileSync(tempFile, newBody);
-      execSync(`gh issue edit ${issueNumber} --body-file ${tempFile}`);
-      unlinkSync(tempFile);
-    } catch (error: any) {
+    try {} catch (error: any) {
       // Clean up temp file on error
       try {
killedBy: Issue #204: GitHub Client Tests GitHubCLIClient updateIssueBody should update issue body successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/issue-204-body.md", "Updated issue body"

Number of calls: 0

[Killed] BlockStatement
src/github-client.ts:36:26
       writeFileSync(tempFile, newBody);
       execSync(`gh issue edit ${issueNumber} --body-file ${tempFile}`);
       unlinkSync(tempFile);
-    } catch (error: any) {
-      // Clean up temp file on error
-      try {
-        unlinkSync(tempFile);
-      } catch {}
-      throw new Error(`Failed to update issue #${issueNumber}: ${error.message}`);
-    }
+    } catch (error: any) {}
   }
 }
killedBy: Issue #204: GitHub Client Tests GitHubCLIClient updateIssueBody should clean up temp file on gh command error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/github-client.ts:38:11
       unlinkSync(tempFile);
     } catch (error: any) {
       // Clean up temp file on error
-      try {
-        unlinkSync(tempFile);
-      } catch {}
+      try {} catch {}
       throw new Error(`Failed to update issue #${issueNumber}: ${error.message}`);
     }
killedBy: Issue #204: GitHub Client Tests GitHubCLIClient updateIssueBody should clean up temp file on gh command error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/tmp/issue-204-body.md"

Number of calls: 0

[Killed] BlockStatement
src/github-client.ts:52:59
 export class MockGitHubClient implements GitHubClient {
   private issues: Map<number, string> = new Map();
 
-  constructor(initialIssues: Record<number, string> = {}) {
-    for (const [number, body] of Object.entries(initialIssues)) {
-      this.issues.set(parseInt(number), body);
-    }
-  }
+  constructor(initialIssues: Record<number, string> = {}) {}
 
   async getIssueBody(issueNumber: number): Promise<string> {
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should initialize with provided issues
statusReason: Error: Issue #100 not found

[Killed] BlockStatement
src/github-client.ts:53:65
   private issues: Map<number, string> = new Map();
 
   constructor(initialIssues: Record<number, string> = {}) {
-    for (const [number, body] of Object.entries(initialIssues)) {
-      this.issues.set(parseInt(number), body);
-    }
+    for (const [number, body] of Object.entries(initialIssues)) {}
   }
 
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should initialize with provided issues
statusReason: Error: Issue #100 not found

[Killed] BlockStatement
src/github-client.ts:66:78
     return body;
   }
 
-  async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
-    if (!this.issues.has(issueNumber)) {
-      throw new Error(`Issue #${issueNumber} not found`);
-    }
-    this.issues.set(issueNumber, newBody);
-  }
+  async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {}
 
   // Test helpers
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should update existing issues
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Updated body"
Received: "Original body"

[Killed] ConditionalExpression
src/github-client.ts:67:9
   }
 
   async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
-    if (!this.issues.has(issueNumber)) {
+    if (true) {
       throw new Error(`Issue #${issueNumber} not found`);
     }
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should update existing issues
statusReason: Error: Issue #100 not found

[Killed] BlockStatement
src/github-client.ts:67:40
   }
 
   async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
-    if (!this.issues.has(issueNumber)) {
-      throw new Error(`Issue #${issueNumber} not found`);
-    }
+    if (!this.issues.has(issueNumber)) {}
     this.issues.set(issueNumber, newBody);
   }
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should reject updates to non-existent issues
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/github-client.ts:68:23
 
   async updateIssueBody(issueNumber: number, newBody: string): Promise<void> {
     if (!this.issues.has(issueNumber)) {
-      throw new Error(`Issue #${issueNumber} not found`);
+      throw new Error(``);
     }
     this.issues.set(issueNumber, newBody);
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should reject updates to non-existent issues
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Issue #999 not found"
Received message:   ""

      169 |         } else {
      170 |           stryCov_9fa48("37");
    > 171 |           throw new Error(stryMutAct_9fa48("38") ? `` : (stryCov_9fa48("38"), `Issue #${issueNumber} not found`));

[Killed] BlockStatement
src/github-client.ts:78:57
     return this.issues.get(issueNumber);
   }
 
-  setIssueBody(issueNumber: number, body: string): void {
-    this.issues.set(issueNumber, body);
-  }
+  setIssueBody(issueNumber: number, body: string): void {}
 }
killedBy: Issue #204: GitHub Client Tests MockGitHubClient should support test helper methods
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Test body"
Received: undefined
