[Killed] BooleanLiteral
src/issue-updater.ts:10:7
  * @returns Updated issue body with the criterion marked as completed
  */
 export function markCriterionComplete(issueBody: string, index: number): string {
-  if (!issueBody) {
+  if (issueBody) {
     throw new Error('Issue body is required');
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Issue body is required

[Killed] ConditionalExpression
src/issue-updater.ts:10:7
  * @returns Updated issue body with the criterion marked as completed
  */
 export function markCriterionComplete(issueBody: string, index: number): string {
-  if (!issueBody) {
+  if (false) {
     throw new Error('Issue body is required');
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should handle empty issue body for index-based marking
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Issue body is required"
Received message:   "Criterion index 1 not found"

       97 |       }
       98 |     }
    >  99 |     throw new Error(stryMutAct_9fa48("65") ? `` : (stryCov_9fa48("65"), `Criterion index ${index} not found`));

[Killed] BlockStatement
src/issue-updater.ts:17:42
   const lines = issueBody.split('\n');
   let foundCount = 0;
 
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i];
-    
-    // Check if this is an unchecked criterion
-    if (/^- \[ \] /.test(line)) {
-      foundCount++;
-      
-      if (foundCount === index) {
-        // Mark this criterion as complete
-        lines[i] = line.replace('- [ ]', '- [x]');
-        return lines.join('\n');
-      }
-    }
-  }
+  for (let i = 0; i < lines.length; i++) {}
 
   throw new Error(`Criterion index ${index} not found`);
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] BlockStatement
src/issue-updater.ts:21:33
     const line = lines[i];
     
     // Check if this is an unchecked criterion
-    if (/^- \[ \] /.test(line)) {
-      foundCount++;
-      
-      if (foundCount === index) {
-        // Mark this criterion as complete
-        lines[i] = line.replace('- [ ]', '- [x]');
-        return lines.join('\n');
-      }
-    }
+    if (/^- \[ \] /.test(line)) {}
   }
 
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] ConditionalExpression
src/issue-updater.ts:21:9
     const line = lines[i];
     
     // Check if this is an unchecked criterion
-    if (/^- \[ \] /.test(line)) {
+    if (false) {
       foundCount++;
       
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] UpdateOperator
src/issue-updater.ts:22:7
     
     // Check if this is an unchecked criterion
     if (/^- \[ \] /.test(line)) {
-      foundCount++;
+      foundCount--;
       
       if (foundCount === index) {
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] ConditionalExpression
src/issue-updater.ts:24:11
     if (/^- \[ \] /.test(line)) {
       foundCount++;
       
-      if (foundCount === index) {
+      if (false) {
         // Mark this criterion as complete
         lines[i] = line.replace('- [ ]', '- [x]');
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] BlockStatement
src/issue-updater.ts:24:33
     if (/^- \[ \] /.test(line)) {
       foundCount++;
       
-      if (foundCount === index) {
-        // Mark this criterion as complete
-        lines[i] = line.replace('- [ ]', '- [x]');
-        return lines.join('\n');
-      }
+      if (foundCount === index) {}
     }
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: Criterion index 1 not found

[Killed] StringLiteral
src/issue-updater.ts:26:33
       
       if (foundCount === index) {
         // Mark this criterion as complete
-        lines[i] = line.replace('- [ ]', '- [x]');
+        lines[i] = line.replace("", '- [x]');
         return lines.join('\n');
       }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating should mark acceptance criterion as completed
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- [x] First acceptance criterion"
Received string:    "
## Acceptance Criteria
- [x]- [ ] First acceptance criterion
- [ ] Second acceptance criterion
- [ ] Third acceptance criterion

[Killed] BooleanLiteral
src/issue-updater.ts:42:7
  * @returns Updated issue body with the criterion marked as completed
  */
 export function markCriterionCompleteById(issueBody: string, acId: string): string {
-  if (!issueBody) {
+  if (issueBody) {
     throw new Error('Issue body is required');
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: Issue body is required

[Killed] ConditionalExpression
src/issue-updater.ts:42:7
  * @returns Updated issue body with the criterion marked as completed
  */
 export function markCriterionCompleteById(issueBody: string, acId: string): string {
-  if (!issueBody) {
+  if (true) {
     throw new Error('Issue body is required');
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: Issue body is required

[Killed] BooleanLiteral
src/issue-updater.ts:46:7
     throw new Error('Issue body is required');
   }
 
-  if (!acId) {
+  if (acId) {
     throw new Error('AC ID is required');
   }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: AC ID is required

[Killed] BlockStatement
src/issue-updater.ts:46:14
     throw new Error('Issue body is required');
   }
 
-  if (!acId) {
-    throw new Error('AC ID is required');
-  }
+  if (!acId) {}
 
   const lines = issueBody.split('\n');
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should handle empty AC ID
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "AC ID is required"
Received message:   "AC ID  not found"

      147 |       }
      148 |     }
    > 149 |     throw new Error(stryMutAct_9fa48("90") ? `` : (stryCov_9fa48("90"), `AC ID ${acId} not found`));

[Killed] BlockStatement
src/issue-updater.ts:53:42
   const lines = issueBody.split('\n');
   const acPattern = new RegExp(`^- \\[ \\] ${acId}:`);
 
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i];
-    
-    if (acPattern.test(line)) {
-      lines[i] = line.replace('- [ ]', '- [x]');
-      return lines.join('\n');
-    }
-  }
+  for (let i = 0; i < lines.length; i++) {}
 
   throw new Error(`AC ID ${acId} not found`);
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: AC ID AC-2 not found

[Killed] ConditionalExpression
src/issue-updater.ts:56:9
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i];
     
-    if (acPattern.test(line)) {
+    if (false) {
       lines[i] = line.replace('- [ ]', '- [x]');
       return lines.join('\n');
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: AC ID AC-2 not found

[Killed] BlockStatement
src/issue-updater.ts:56:31
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i];
     
-    if (acPattern.test(line)) {
-      lines[i] = line.replace('- [ ]', '- [x]');
-      return lines.join('\n');
-    }
+    if (acPattern.test(line)) {}
   }
 
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markCriterionCompleteById should mark criterion by AC ID
statusReason: Error: AC ID AC-2 not found

[Killed] BlockStatement
src/issue-updater.ts:71:61
 /**
  * Set GitHub client (for testing)
  */
-export function setGitHubClient(client: GitHubClient): void {
-  githubClient = client;
-}
+export function setGitHubClient(client: GitHubClient): void {}
 
 /**
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- [x] Handle various markdown checkbox formats"
Received string:    "Create functionality to parse and validate acceptance criteria from GitHub issues.·
## Acceptance Criteria·
### Parser (AC 1-5)
- [x] Create function to parse acceptance criteria from issue body
- [ ] Handle various markdown checkbox formats (- [ ], * [

[Killed] StringLiteral
src/issue-updater.ts:98:21
     };
     
   } catch (error: any) {
-    throw new Error(`Failed to update issue: ${error.message}`);
+    throw new Error(``);
   }
 }
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should reject AC that is already completed
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Acceptance criterion not found"
Received message:   ""

      203 |       } else {
      204 |         stryCov_9fa48("97");
    > 205 |         throw new Error(stryMutAct_9fa48("98") ? `` : (stryCov_9fa48("98"), `Failed to update issue: ${error.message}`));

[Killed] BlockStatement
src/issue-updater.ts:106:19
  * Marks a criterion as complete by matching the description text
  */
 export function markCriterionCompleteByText(issueBody: string, description: string): string {
-  if (!issueBody) {
-    throw new Error('Issue body is required');
-  }
+  if (!issueBody) {}
 
   if (!description || description.trim() === '') {
killedBy: Issue #204: GitHub Integration with Mocks Text-based criterion marking (unit tests) should handle empty issue body
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Issue body is required"
Received message:   "Acceptance criterion not found"

      260 |       } else {
      261 |         stryCov_9fa48("135");
    > 262 |         throw new Error(stryMutAct_9fa48("136") ? "" : (stryCov_9fa48("136"), 'Acceptance criterion not found'));

[Killed] ConditionalExpression
src/issue-updater.ts:106:7
  * Marks a criterion as complete by matching the description text
  */
 export function markCriterionCompleteByText(issueBody: string, description: string): string {
-  if (!issueBody) {
+  if (true) {
     throw new Error('Issue body is required');
   }
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Issue body is required

[Killed] ConditionalExpression
src/issue-updater.ts:110:7
     throw new Error('Issue body is required');
   }
 
-  if (!description || description.trim() === '') {
+  if (false) {
     throw new Error('Description is required');
   }
killedBy: Issue #204: GitHub Integration with Mocks Text-based criterion marking (unit tests) should handle empty description
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Description is required"

Received function did not throw

[Killed] EqualityOperator
src/issue-updater.ts:110:23
     throw new Error('Issue body is required');
   }
 
-  if (!description || description.trim() === '') {
+  if (!description || description.trim() !== '') {
     throw new Error('Description is required');
   }
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Description is required

[Killed] BooleanLiteral
src/issue-updater.ts:115:15
   }
 
   const lines = issueBody.split('\n');
-  let found = false;
+  let found = true;
 
   for (let i = 0; i < lines.length; i++) {
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should reject AC that is already completed
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"message": "AC \"Create function to parse acceptance criteria\" marked as complete in issue #204", "success": true}

[Killed] BlockStatement
src/issue-updater.ts:117:42
   const lines = issueBody.split('\n');
   let found = false;
 
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i];
-    
-    // Check if this line contains the description and is unchecked
-    if (/^- \[ \] /.test(line) && line.toLowerCase().includes(description.toLowerCase())) {
-      lines[i] = line.replace('- [ ]', '- [x]');
-      found = true;
-      break;
-    }
-  }
+  for (let i = 0; i < lines.length; i++) {}
 
   if (!found) {
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Acceptance criterion not found

[Killed] ConditionalExpression
src/issue-updater.ts:121:9
     const line = lines[i];
     
     // Check if this line contains the description and is unchecked
-    if (/^- \[ \] /.test(line) && line.toLowerCase().includes(description.toLowerCase())) {
+    if (true) {
       lines[i] = line.replace('- [ ]', '- [x]');
       found = true;
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- [x] Handle various markdown checkbox formats"
Received string:    "Create functionality to parse and validate acceptance criteria from GitHub issues.·
## Acceptance Criteria·
### Parser (AC 1-5)
- [x] Create function to parse acceptance criteria from issue body
- [ ] Handle various markdown checkbox formats (- [ ], * [

[Killed] ConditionalExpression
src/issue-updater.ts:121:9
     const line = lines[i];
     
     // Check if this line contains the description and is unchecked
-    if (/^- \[ \] /.test(line) && line.toLowerCase().includes(description.toLowerCase())) {
+    if (false) {
       lines[i] = line.replace('- [ ]', '- [x]');
       found = true;
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Acceptance criterion not found

[Killed] StringLiteral
src/issue-updater.ts:122:31
     
     // Check if this line contains the description and is unchecked
     if (/^- \[ \] /.test(line) && line.toLowerCase().includes(description.toLowerCase())) {
-      lines[i] = line.replace('- [ ]', '- [x]');
+      lines[i] = line.replace("", '- [x]');
       found = true;
       break;
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "- [x] Handle various markdown checkbox formats"
Received string:    "Create functionality to parse and validate acceptance criteria from GitHub issues.·
## Acceptance Criteria·
### Parser (AC 1-5)
- [x] Create function to parse acceptance criteria from issue body
- [x]- [ ] Handle various markdown checkbox formats (- [ ],

[Killed] BooleanLiteral
src/issue-updater.ts:123:15
     // Check if this line contains the description and is unchecked
     if (/^- \[ \] /.test(line) && line.toLowerCase().includes(description.toLowerCase())) {
       lines[i] = line.replace('- [ ]', '- [x]');
-      found = true;
+      found = false;
       break;
     }
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Acceptance criterion not found

[Killed] BlockStatement
src/issue-updater.ts:128:15
     }
   }
 
-  if (!found) {
-    throw new Error('Acceptance criterion not found');
-  }
+  if (!found) {}
 
   return lines.join('\n');
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should reject AC that is already completed
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"message": "AC \"Create function to parse acceptance criteria\" marked as complete in issue #204", "success": true}

[Killed] ConditionalExpression
src/issue-updater.ts:128:7
     }
   }
 
-  if (!found) {
+  if (true) {
     throw new Error('Acceptance criterion not found');
   }
killedBy: Issue #204: GitHub Integration with Mocks AC-5: Create CLI command with GitHub integration should successfully mark acceptance criterion as complete
statusReason: Error: Failed to update issue: Acceptance criterion not found

[Killed] StringLiteral
src/issue-updater.ts:155:21
   } else if (options.index) {
     return markCriterionComplete(options.body, options.index);
   } else {
-    throw new Error('Either index or acId is required');
+    throw new Error("");
   }
 }
killedBy: Issue #204: CLI command for updating acceptance criteria AC-5: Create CLI command for parsing and updating markComplete CLI interface should require either index or acId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Either index or acId is required"
Received message:   ""

      308 |       } else {
      309 |         stryCov_9fa48("150");
    > 310 |         throw new Error(stryMutAct_9fa48("151") ? "" : (stryCov_9fa48("151"), 'Either index or acId is required'));
